arribada/CLS-Argos-Linkit-CORE/ports/nrf52840/core/hardware/bmx160/bmx160_defs.h
/* Accel, gyro and aux. sensor length and also their combined
 * length definitions in FIFO */
#define BMX160_FIFO_G_LENGTH                 UINT8_C(6)
#define BMX160_FIFO_A_LENGTH                 UINT8_C(6)
#define BMX160_FIFO_M_LENGTH                 UINT8_C(8)
#define BMX160_FIFO_GA_LENGTH                UINT8_C(12)
#define BMX160_FIFO_MA_LENGTH                UINT8_C(14)
#define BMX160_FIFO_MG_LENGTH                UINT8_C(14)
#define BMX160_FIFO_MGA_LENGTH               UINT8_C(20)

/** FIFO Header Data definitions */
#define BMX160_FIFO_HEAD_SKIP_FRAME          UINT8_C(0x40)
#define BMX160_FIFO_HEAD_SENSOR_TIME         UINT8_C(0x44)
#define BMX160_FIFO_HEAD_INPUT_CONFIG        UINT8_C(0x48)
#define BMX160_FIFO_HEAD_OVER_READ           UINT8_C(0x80)
#define BMX160_FIFO_HEAD_A                   UINT8_C(0x84)
#define BMX160_FIFO_HEAD_G                   UINT8_C(0x88)
#define BMX160_FIFO_HEAD_G_A                 UINT8_C(0x8C)
#define BMX160_FIFO_HEAD_M                   UINT8_C(0x90)
#define BMX160_FIFO_HEAD_M_A                 UINT8_C(0x94)
#define BMX160_FIFO_HEAD_M_G                 UINT8_C(0x98)
#define BMX160_FIFO_HEAD_M_G_A               UINT8_C(0x9C)

/** FIFO sensor time length definitions */
#define BMX160_SENSOR_TIME_LENGTH            UINT8_C(3)

/** FIFO DOWN selection */
/* Accel fifo down-sampling values*/
#define  BMX160_ACCEL_FIFO_DOWN_ZERO         UINT8_C(0x00)
#define  BMX160_ACCEL_FIFO_DOWN_ONE          UINT8_C(0x10)
#define  BMX160_ACCEL_FIFO_DOWN_TWO          UINT8_C(0x20)
#define  BMX160_ACCEL_FIFO_DOWN_THREE        UINT8_C(0x30)
#define  BMX160_ACCEL_FIFO_DOWN_FOUR         UINT8_C(0x40)
#define  BMX160_ACCEL_FIFO_DOWN_FIVE         UINT8_C(0x50)
#define  BMX160_ACCEL_FIFO_DOWN_SIX          UINT8_C(0x60)
#define  BMX160_ACCEL_FIFO_DOWN_SEVEN        UINT8_C(0x70)

/* Gyro fifo down-smapling values*/
#define  BMX160_GYRO_FIFO_DOWN_ZERO          UINT8_C(0x00)
#define  BMX160_GYRO_FIFO_DOWN_ONE           UINT8_C(0x01)
#define  BMX160_GYRO_FIFO_DOWN_TWO           UINT8_C(0x02)
#define  BMX160_GYRO_FIFO_DOWN_THREE         UINT8_C(0x03)
#define  BMX160_GYRO_FIFO_DOWN_FOUR          UINT8_C(0x04)
#define  BMX160_GYRO_FIFO_DOWN_FIVE          UINT8_C(0x05)
#define  BMX160_GYRO_FIFO_DOWN_SIX           UINT8_C(0x06)
#define  BMX160_GYRO_FIFO_DOWN_SEVEN         UINT8_C(0x07)

/* Accel Fifo filter enable*/
#define  BMX160_ACCEL_FIFO_FILT_EN           UINT8_C(0x80)

/* Gyro Fifo filter enable*/
#define  BMX160_GYRO_FIFO_FILT_EN            UINT8_C(0x08)

/** Definitions to check validity of FIFO frames */
#define FIFO_CONFIG_MSB_CHECK                UINT8_C(0x80)
#define FIFO_CONFIG_LSB_CHECK                UINT8_C(0x00)

/*! BMX160 accel FOC configurations */
#define BMX160_FOC_ACCEL_DISABLED            UINT8_C(0x00)
#define BMX160_FOC_ACCEL_POSITIVE_G          UINT8_C(0x01)
#define BMX160_FOC_ACCEL_NEGATIVE_G          UINT8_C(0x02)
#define BMX160_FOC_ACCEL_0G                  UINT8_C(0x03)

/** Array Parameter DefinItions */
#define BMX160_SENSOR_TIME_LSB_BYTE          UINT8_C(0)
#define BMX160_SENSOR_TIME_XLSB_BYTE         UINT8_C(1)
#define BMX160_SENSOR_TIME_MSB_BYTE          UINT8_C(2)

/** Interface settings */
#define BMX160_SPI_INTF                      UINT8_C(1)
#define BMX160_I2C_INTF                      UINT8_C(0)
#define BMX160_SPI_RD_MASK                   UINT8_C(0x80)
#define BMX160_SPI_WR_MASK                   UINT8_C(0x7F)

/* Sensor & time select definition*/
#define BMX160_ACCEL_SEL                     UINT8_C(0x01)
#define BMX160_GYRO_SEL                      UINT8_C(0x02)
#define BMX160_TIME_SEL                      UINT8_C(0x04)

/* Sensor select mask*/
#define BMX160_SEN_SEL_MASK                  UINT8_C(0x07)

/* Error code mask */
#define BMX160_ERR_REG_MASK                  UINT8_C(0x0F)

/* BMX160 I2C address */
#define BMX160_I2C_ADDR                      UINT8_C(0x68)

/* BMX160 secondary IF address */
#define BMX160_AUX_BMM150_I2C_ADDR           UINT8_C(0x69)

/** BMX160 Length definitions */
#define BMX160_ONE                           UINT8_C(1)
#define BMX160_TWO                           UINT8_C(2)
#define BMX160_THREE                         UINT8_C(3)
#define BMX160_FOUR                          UINT8_C(4)
#define BMX160_FIVE                          UINT8_C(5)

/** BMX160 fifo level Margin */
#define BMX160_FIFO_LEVEL_MARGIN             UINT8_C(16)

/** BMX160 fifo flush Command */
#define BMX160_FIFO_FLUSH_VALUE              UINT8_C(0xB0)

/** BMX160 offset values for xyz axes of accel */
#define BMX160_ACCEL_MIN_OFFSET              INT8_C(-128)
#define BMX160_ACCEL_MAX_OFFSET              INT8_C(127)

/** BMX160 offset values for xyz axes of gyro */
#define BMX160_GYRO_MIN_OFFSET               INT16_C(-512)
#define BMX160_GYRO_MAX_OFFSET               INT16_C(511)

/** BMX160 fifo full interrupt position and mask */
#define BMX160_FIFO_FULL_INT_POS             UINT8_C(5)
#define BMX160_FIFO_FULL_INT_MSK             UINT8_C(0x20)
#define BMX160_FIFO_WTM_INT_POS              UINT8_C(6)
#define BMX160_FIFO_WTM_INT_MSK              UINT8_C(0x40)

#define BMX160_FIFO_FULL_INT_PIN1_POS        UINT8_C(5)
#define BMX160_FIFO_FULL_INT_PIN1_MSK        UINT8_C(0x20)
#define BMX160_FIFO_FULL_INT_PIN2_POS        UINT8_C(1)
#define BMX160_FIFO_FULL_INT_PIN2_MSK        UINT8_C(0x02)

#define BMX160_FIFO_WTM_INT_PIN1_POS         UINT8_C(6)
#define BMX160_FIFO_WTM_INT_PIN1_MSK         UINT8_C(0x40)
#define BMX160_FIFO_WTM_INT_PIN2_POS         UINT8_C(2)
#define BMX160_FIFO_WTM_INT_PIN2_MSK         UINT8_C(0x04)

#define BMX160_MANUAL_MODE_EN_POS            UINT8_C(7)
#define BMX160_MANUAL_MODE_EN_MSK            UINT8_C(0x80)
#define BMX160_AUX_READ_BURST_POS            UINT8_C(0)
#define BMX160_AUX_READ_BURST_MSK            UINT8_C(0x03)

#define BMX160_GYRO_SELF_TEST_POS            UINT8_C(4)
#define BMX160_GYRO_SELF_TEST_MSK            UINT8_C(0x10)
#define BMX160_GYRO_SELF_TEST_STATUS_POS     UINT8_C(1)
#define BMX160_GYRO_SELF_TEST_STATUS_MSK     UINT8_C(0x02)

#define BMX160_GYRO_FOC_EN_POS               UINT8_C(6)
#define BMX160_GYRO_FOC_EN_MSK               UINT8_C(0x40)

