arribada/CLS-Argos-Linkit-CORE/ports/nrf52840/core/hardware/bmx160/bmx160_defs.h
    /*! Enabling offset compensation for gyro in data registers
     * Assignable macros :
     *  - BMX160_ENABLE
     *  - BMX160_DISABLE
     */
    uint8_t gyro_off_en;
};

/*!
 * @brief bmx160 accel gyro offsets
 */
struct bmx160_offsets
{
    /*! Accel offset for x axis */
    int8_t off_acc_x;

    /*! Accel offset for y axis */
    int8_t off_acc_y;

    /*! Accel offset for z axis */
    int8_t off_acc_z;

    /*! Gyro offset for x axis */
    int16_t off_gyro_x;

    /*! Gyro offset for y axis */
    int16_t off_gyro_y;

    /*! Gyro offset for z axis */
    int16_t off_gyro_z;
};

/*!
 * @brief FIFO aux. sensor data structure
 */
struct bmx160_aux_fifo_data
{
    /*! The value of aux. sensor x LSB data */
    uint8_t aux_x_lsb;

    /*! The value of aux. sensor x MSB data */
    uint8_t aux_x_msb;

    /*! The value of aux. sensor y LSB data */
    uint8_t aux_y_lsb;

    /*! The value of aux. sensor y MSB data */
    uint8_t aux_y_msb;

    /*! The value of aux. sensor z LSB data */
    uint8_t aux_z_lsb;

    /*! The value of aux. sensor z MSB data */
    uint8_t aux_z_msb;

    /*! The value of aux. sensor r for BMM150 LSB data */
    uint8_t aux_r_y2_lsb;

    /*! The value of aux. sensor r for BMM150 MSB data */
    uint8_t aux_r_y2_msb;
};

/*!
 * @brief bmx160 sensor select structure
 */
enum bmx160_select_sensor {
    BMX160_ACCEL_ONLY = 1,
    BMX160_GYRO_ONLY,
    BMX160_BOTH_ACCEL_AND_GYRO
};

/*!
 * @brief bmx160 sensor step detector mode structure
 */
enum bmx160_step_detect_mode {
    BMX160_STEP_DETECT_NORMAL,
    BMX160_STEP_DETECT_SENSITIVE,
    BMX160_STEP_DETECT_ROBUST,

    /*! Non recommended User defined setting */
    BMX160_STEP_DETECT_USER_DEFINE
};

/*!
 * @brief enum for auxiliary burst read selection
 */
enum bm160_aux_read_len {
    BMX160_AUX_READ_LEN_0,
    BMX160_AUX_READ_LEN_1,
    BMX160_AUX_READ_LEN_2,
    BMX160_AUX_READ_LEN_3
};

/*!
 * @brief bmx160 sensor configuration structure
 */
struct bmx160_cfg
{
    /*! power mode */
    uint8_t power;

    /*! output data rate */
    uint8_t odr;

    /*! range */
    uint8_t range;

    /*! bandwidth */
    uint8_t bw;
};

/*!
 * @brief Aux sensor configuration structure
 */
struct bmx160_aux_cfg
{
    /*! Aux sensor, 1 - enable 0 - disable */
    uint8_t aux_sensor_enable : 1;

    /*! Aux manual/auto mode status */
    uint8_t manual_enable : 1;

    /*! Aux read burst length */
    uint8_t aux_rd_burst_len : 2;

    /*! output data rate */
    uint8_t aux_odr : 4;

    /*! i2c addr of auxiliary sensor */
    uint8_t aux_i2c_addr;
};

/*!
 * @brief bmx160 interrupt channel selection structure
 */
enum bmx160_int_channel {
    /*! Un-map both channels */
    BMX160_INT_CHANNEL_NONE,

    /*! interrupt Channel 1 */
    BMX160_INT_CHANNEL_1,

    /*! interrupt Channel 2 */
    BMX160_INT_CHANNEL_2,

    /*! Map both channels */
    BMX160_INT_CHANNEL_BOTH
};
enum bmx160_int_types {
    /*! Slope/Any-motion interrupt */
    BMX160_ACC_ANY_MOTION_INT,

    /*! Significant motion interrupt */
    BMX160_ACC_SIG_MOTION_INT,

    /*! Step detector interrupt */
    BMX160_STEP_DETECT_INT,

    /*! double tap interrupt */
    BMX160_ACC_DOUBLE_TAP_INT,

    /*! single tap interrupt */
    BMX160_ACC_SINGLE_TAP_INT,

    /*! orientation interrupt */
    BMX160_ACC_ORIENT_INT,

    /*! flat interrupt */
    BMX160_ACC_FLAT_INT,

    /*! high-g interrupt */
    BMX160_ACC_HIGH_G_INT,

    /*! low-g interrupt */
    BMX160_ACC_LOW_G_INT,

    /*! slow/no-motion interrupt */
    BMX160_ACC_SLOW_NO_MOTION_INT,

    /*! data ready interrupt  */
    BMX160_ACC_GYRO_DATA_RDY_INT,

    /*! fifo full interrupt */
    BMX160_ACC_GYRO_FIFO_FULL_INT,

    /*! fifo watermark interrupt */
    BMX160_ACC_GYRO_FIFO_WATERMARK_INT,

    /*! fifo tagging feature support */
    BMX160_FIFO_TAG_INT_PIN
};

/*!
 * @brief bmx160 active state of any & sig motion interrupt.
 */
enum bmx160_any_sig_motion_active_interrupt_state {
    /*! Both any & sig motion are disabled */
    BMX160_BOTH_ANY_SIG_MOTION_DISABLED = -1,

    /*! Any-motion selected */
    BMX160_ANY_MOTION_ENABLED,

    /*! Sig-motion selected */
    BMX160_SIG_MOTION_ENABLED
};
struct bmx160_acc_tap_int_cfg
{
#if LITTLE_ENDIAN == 1

    /*! tap threshold */
    uint16_t tap_thr : 5;

    /*! tap shock */
    uint16_t tap_shock : 1;

    /*! tap quiet */
    uint16_t tap_quiet : 1;

    /*! tap duration */
    uint16_t tap_dur : 3;

    /*! data source 0- filter & 1 pre-filter*/
    uint16_t tap_data_src : 1;

    /*! tap enable, 1 - enable, 0 - disable */
    uint16_t tap_en : 1;
#elif BIG_ENDIAN == 1

    /*! tap enable, 1 - enable, 0 - disable */
    uint16_t tap_en : 1;

    /*! data source 0- filter & 1 pre-filter*/
    uint16_t tap_data_src : 1;

    /*! tap duration */
    uint16_t tap_dur : 3;

    /*! tap quiet */
    uint16_t tap_quiet : 1;

    /*! tap shock */
    uint16_t tap_shock : 1;

    /*! tap threshold */
    uint16_t tap_thr : 5;
#endif
};
struct bmx160_acc_any_mot_int_cfg
{
#if LITTLE_ENDIAN == 1

    /*! 1 any-motion enable, 0 - any-motion disable */
    uint8_t anymotion_en : 1;

    /*! slope interrupt x, 1 - enable, 0 - disable */
    uint8_t anymotion_x : 1;

    /*! slope interrupt y, 1 - enable, 0 - disable */
    uint8_t anymotion_y : 1;

    /*! slope interrupt z, 1 - enable, 0 - disable */
    uint8_t anymotion_z : 1;

    /*! slope duration */
    uint8_t anymotion_dur : 2;

    /*! data source 0- filter & 1 pre-filter*/
    uint8_t anymotion_data_src : 1;

    /*! slope threshold */
    uint8_t anymotion_thr;
#elif BIG_ENDIAN == 1

    /*! slope threshold */
    uint8_t anymotion_thr;

    /*! data source 0- filter & 1 pre-filter*/
    uint8_t anymotion_data_src : 1;

    /*! slope duration */
    uint8_t anymotion_dur : 2;

    /*! slope interrupt z, 1 - enable, 0 - disable */
    uint8_t anymotion_z : 1;

    /*! slope interrupt y, 1 - enable, 0 - disable */
    uint8_t anymotion_y : 1;

    /*! slope interrupt x, 1 - enable, 0 - disable */
    uint8_t anymotion_x : 1;

    /*! 1 any-motion enable, 0 - any-motion disable */
    uint8_t anymotion_en : 1;
#endif
};
struct bmx160_acc_sig_mot_int_cfg
{
#if LITTLE_ENDIAN == 1

